const List = () => {
    return(
        <div className="list-container">
            <h4>یک فهرست</h4>
            <ul>
                <li><a href="#">این یک متن آزمایشی برای تست جانمایی متون است</a></li>
                <li><a href="#">و هیچ کاربرد دیگری ندارد. این یک</a></li>
                <li><a href="#">متن آزمایشی برای تست جانمایی متون</a></li>
                <li><a href="#">است و هیچ کاربرد</a></li>
                <li><a href="#">دیگری ندارد. این یک متن آزمایشی برای تست</a></li>
                <li><a href="#"> جانمایی متون است و هیچ کاربرد دیگری</a></li>
                <li><a href="#">این یک متن آزمایشی برای تست جانمایی متون است</a></li>
                <li><a href="#" id="last-child">و هیچ کاربرد دیگری ندارد. این یک</a></li>
            </ul>
        </div>
    )
}

export default List